[M_Ep15_CharacterAssassination MissionDefinition]
MissionDescription="Mordecai decides that if the soldiers find the burial site, they can find Jack. Now help the leader to pick up some magnetic items. [place]There is no light[-place], You're ready to jump [place]Hyperion Information Library[-place] and get the information you need."
TurnInDescription="No need to change it now, no problem. It's time to finish it."

[M_Ep15_CharacterAssassination:CrankPressure MissionObjectiveDefinition]
ProgressMessage="Open the starting point"

[M_Ep15_CharacterAssassination:FindEvidence1 MissionObjectiveDefinition]
ProgressMessage="Enter the first stage"

[M_Ep15_CharacterAssassination:FindEvidence2 MissionObjectiveDefinition]
ProgressMessage="Access to another station"

[M_Ep15_CharacterAssassination:GettoPipeLineSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai decides that if he finds out where the soldiers are hiding, he can find Jack. [place]Hyperion Data Service Fee[-place] We have the information you need. Pressure increases in the prison's iridium tubes. Just for fun. Once at the canal, Mordecai said that the canal would open up like mud and he would be trapped in the fence.."

[M_Ep15_CharacterAssassination:GoToArchiveBuildingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai decides to look for Jack if he can find the warrior's grave. ONE. [place]About Hyperion[-place] We have the information you need. With the collapse of Eridium Tube, the stock's direction became clear. Mordecai invites you to see where this warrior is buried.."

[M_Ep15_CharacterAssassination:GoToPumpingStationSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai decides to find Jack if he finds the soldier's grave. They are [place]Hyperion Database[-place] Get the information you need. Mordecai fired the iridium tube to reach the crew. The pipe will explode and you can enter the palace through the large hole left by the explosion.."

[M_Ep15_CharacterAssassination:PumpStation2ValveCranked MissionObjectiveDefinition]
ProgressMessage="The second fuel pump is full"

[M_Ep15_CharacterAssassination:PumpStation3ValveCranked MissionObjectiveDefinition]
ProgressMessage="Traffic is the third problem"

[M_Ep15_CharacterAssassination:ReturntoClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="No need to change it now, no problem. It's time to finish it."
